Revit 2027 API
CableTraySettings.GetCableTraySettings Method
 Gets the cable tray settings of the project.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static CableTraySettings GetCableTraySettings(
	Document document
)
Public Shared Function GetCableTraySettings (
	document As Document
) As CableTraySettings
public:
static CableTraySettings^ GetCableTraySettings(
	Document^ document
)
static member GetCableTraySettings :
        document : Document -> CableTraySettings
Parameters
document Document
 The document.
Return Value
CableTraySettings
 The cable tray settings of the project.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
CableTraySettings Class
Autodesk.Revit.DB.Electrical Namespace